# Prácticas con SQL

Para executar as consultas SQL debes ter acceso a un servidor Mysql/MariaDB coa base de datos "universidade" cargada.

In [1]:
# Preparación do environment

# Instalación de librarías
# ipython-sql
# pymysql

# load the ipython-sql extension
%load_ext sql

In [1]:
# Conexión á base de datos
# usuario: 'user'
# contrasinal: 'password'ArithmeticError

In [ ]:
user = 'user'
password = 'password'
connection_string = f'mysql+pymysql://{user}:{password}@192.168.33.150:3306/universidade'
%sql $connection_string

In [2]:
user = 'user'
password = 'password'
connection_string = f'mysql+pymysql://{user}:{password}@10.133.27.212:3306/universidade'
%sql $connection_string

'Connected: user@universidade'

## Esquema Database Universidade

![schema](esquema_db_universidade.png)

In [ ]:
# 1. Nomes e apelidos das persoas

In [3]:
%%sql
SELECT nome, apelido
FROM persoa;

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
10 rows affected.

[('Luis', 'Ramírez'),
 ('Laura', 'Beltrán'),
 ('Pepe', 'Pérez'),
 ('Juan', 'Sánchez'),
 ('Luis', 'Jiménez'),
 ('Rosa', 'García'),
 ('Jorge', 'Sáenz'),
 ('María', 'Gutiérrez'),
 ('Rosario', 'Díaz'),
 ('Elena', 'González')]

In [2]:
# 2. Códigos, nome e créditos das materias.

In [5]:
%%sql
SELECT idMateria as codigo, nome, creditos
FROM materia;

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
5 rows affected.

[('115', 'Seguridad Vial', Decimal('4.50')),
 ('130113', 'Programación I', Decimal('9.00')),
 ('130122', 'Análisis II', Decimal('9.00')),
 ('150212', 'Química Física', Decimal('4.50')),
 ('160002', 'Contabilidad', Decimal('6.00'))]

In [3]:
# 3. Datos das persoas.

In [6]:
%sql SELECT * FROM persoa

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
10 rows affected.

[('16161616A', 'Luis', 'Ramírez', 'Haro', 'Pez', '34', '941111111', datetime.date(2069, 1, 1), '1'),
 ('17171717A', 'Laura', 'Beltrán', 'Madrid', 'Gran Vía', '23', '912121212', datetime.date(1974, 8, 8), '0'),
 ('18181818A', 'Pepe', 'Pérez', 'Madrid', 'Percebe', '13', '913131313', datetime.date(1980, 2, 2), '1'),
 ('19191919A', 'Juan', 'Sánchez', 'Bilbao', 'Melancolía', '7', '944141414', datetime.date(2066, 3, 3), '1'),
 ('20202020A', 'Luis', 'Jiménez', 'Nájera', 'Cigüeña', '15', '941151515', datetime.date(1979, 3, 3), '1'),
 ('21212121A', 'Rosa', 'García', 'Haro', 'Alegría', '16', '941161616', datetime.date(1978, 4, 4), '0'),
 ('23232323A', 'Jorge', 'Sáenz', 'Logroño', 'Luis Ulloa', '17', '941171717', datetime.date(1978, 9, 9), '1'),
 ('24242424A', 'María', 'Gutiérrez', 'Logroño', 'Avda. de la Paz', '18', '941181818', datetime.date(2064, 10, 10), '0'),
 ('25252525A', 'Rosario', 'Díaz', 'Logroño', 'Percebe', '19', '941191919', datetime.date(1971, 11, 11), '0'),
 ('26262626A', 'Elena', 'González', 'Logroño', 'Percebe', '20', '941202020', datetime.date(1975, 5, 5), '0')]

In [4]:
# 4. Posibilidades de créditos das asignaturas (usar DISTINCT).

In [7]:
%sql SELECT DISTINCT(creditos) FROM materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
3 rows affected.

[(Decimal('4.50'),), (Decimal('9.00'),), (Decimal('6.00'),)]

In [5]:
# 5. Posibilidades de custo, en cada curso das asignaturas.

In [14]:
%sql SELECT curso, nome, custoBasico from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
5 rows affected.

[('', 'Seguridad Vial', Decimal('30.00')),
 ('1', 'Programación I', Decimal('60.00')),
 ('2', 'Análisis II', Decimal('60.00')),
 ('1', 'Química Física', Decimal('70.00')),
 ('1', 'Contabilidad', Decimal('70.00'))]

In [6]:
# 6. Suma do custo das materias.

In [17]:
%sql SELECT SUM(custoBasico) as "Total custo" from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(Decimal('290.00'),)]

In [7]:
# 7. Cantas asignaturas hai?

In [19]:
%sql SELECT count(*) as "Numero materias" from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(5,)]

In [8]:
# 8. Custo da materia máis cara.

In [20]:
%sql select nome, custoBasico as custo from materia order by custoBasico desc limit 1

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[('Química Física', Decimal('70.00'))]

In [9]:
# 9. Custo da asignatura máis barata.

In [21]:
%sql select nome, custoBasico as custo from materia order by custoBasico asc limit 1

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [10]:
# 10. Custo máximo, mínimo e medio das materias.

In [26]:
%%sql select 
max(custoBasico) as máximo,
min(custoBasico) as mínimo,
avg(custoBasico) as medio
from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(Decimal('70.00'), Decimal('30.00'), Decimal('58.000000'))]

In [11]:
# 11. Cantas posibilidades de créditos de asignatura hai?

In [30]:
%sql select count(distinct(creditos)) as posibilidades from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(3,)]

In [12]:
# 12. Cantos cursos hai?

In [35]:
%sql select count(distinct(curso)) as num_cursos from materia

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(3,)]

In [13]:
# 13. Cantas cidades e nomes distintos hai?

In [ ]:
# Precísanse dúas consultas

In [40]:
%sql select count(distinct(cidade)) as num_cidades from persoa

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(5,)]

In [41]:
%sql select count(distinct(nome)) as num_nome from persoa

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[(9,)]

In [14]:
# 14. Nome e créditos das asignaturas do primeiro cuatrimestre.

In [44]:
%sql select nome, creditos, cuadrimestre from materia where cuadrimestre = 1

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
3 rows affected.

[('Seguridad Vial', Decimal('4.50'), '1'),
 ('Programación I', Decimal('9.00'), '1'),
 ('Contabilidad', Decimal('6.00'), '1')]

In [15]:
# 15. Nome e custo básico das asignaturas de máis de 4,5 créditos.

In [49]:
%sql select nome, custoBasico from materia where creditos > 4.5

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
3 rows affected.

[('Programación I', Decimal('60.00')),
 ('Análisis II', Decimal('60.00')),
 ('Contabilidad', Decimal('70.00'))]

In [16]:
# 16. Nome das materias cuxo custo está entre 25 e 25 euros. (Con e sen BETWEEN).

In [50]:
%sql select nome, custoBasico from materia where custoBasico > 25 and custoBasico < 50

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [53]:
%sql select nome, custoBasico from materia where custoBasico between 25 and 50

 * mysql+pymysql://user:***@10.133.27.212:3306/universidade
1 rows affected.

[('Seguridad Vial', Decimal('30.00'))]

In [17]:
# 17. Mostrar o Id do alumnado matriculado na asignatura '150212' ou 
# ben na '130113', ou en ambas as dúas. (Con e sen IN).

In [18]:
# 18. Mostrar o Id do alumnado matriculado en calquera asignatura salvo a '150212' ou a '130113'.

In [19]:
# 19.Nome das asignaturas do segundo cuatrimestre que non sexan de 6 créditos.

In [20]:
# 20. Mostrar o nome das asignaturas cuxo custo por crédito sexa maior de 8 euros.

In [21]:
# 21. Nome e número de horas de todas as asignaturas (1crédito = 10h).

In [22]:
# 22. Mostrar o nome e o apelido das persoas cuxo apelido comece pola letra 'G'.

In [23]:
# 23. Datos das persoas que haceron en 1978.

In [24]:
# 24. Mostrar o nome das persoas para as que se descoñece a data de nacemento.

In [25]:
# 25. Mostrar as materials que non pertencen a ningunha titulación.

In [26]:
# 26. Listaxe do nome completo das persoas, os seus teléfonos e os seus enderezos,
# chamando á columna do nome 'NomeCompleto' e á de enderezos 'Enderezo'

In [27]:
# 27. Cal é o día seguinte ao día no que naceu cada persoa?

In [28]:
# 28. Anos das persoas na base de datos.

In [29]:
# 29. Listaxe de persoas ordenadas por apelidos e nome.

In [30]:
# 30. Listaxe de persoas maiores de 25 anos ordenadas por apelidos e nome.

In [31]:
# 31. Listaxe que mostre as asignaturas co seu custo por crédito ordenadas polo seu custo por crédito.

In [32]:
# 32. Listaxe de nomes completos de todos os alumnos.

In [33]:
# 33. Listaxe de alumnado matriculado que vive en 'La Rioja'.

In [34]:
# 34. Listaxe de asignaturas impartidas por profesores de Logroño.

In [35]:
# 35. Listaxe de profesores que ademais son alumnos.

In [36]:
# 36. Nomes completos dos profesores que ademais son alumnos.

In [37]:
# 37. Nomes completos do alumnado que cursa a materia de 'Seguridad Vial'.

In [38]:
# 38. Nomes completos do alumnado que cursa algunha asignatura do 2º cuatrimestre.

In [39]:
# 39. Nomes do profesorado que imparte polo menos unha asignatura.

In [42]:
# 40. Suma dos créditos das asignaturas de Matemáticas.

In [41]:
# 41. Número de asignaturas da titulación de Matemáticas.

In [43]:
# 42. Id das titulacións nas que está matriculado o alumno co DNI '18181818A'
# sabendo que para que un alumno esté matriculado nunha titulación basta con que 
# esté matriculado nalgunha das súas asignaturas.

In [44]:
# 43. Cal sería o custo global de cursar a titulación de Matemáticas se o custo de cada asignatura
# fora incrementado un 7%.

In [45]:
# 44. Profesorado que tamén é alumno indicando a asignatura ou asignaturas que cursan.

In [46]:
# 45. Titulacións (nomes) nas que imparte docencia cada profesor, xunto co nome de cada profesor.

In [47]:
# 46. Listaxe ordenado por nome de titulación e nome da asignatura de todas as asignaturas,
# mostrando ademais a titulación, nome da asignatura e nome do profesor.

In [49]:
# 47. Nomes completos de alumnos matriculados en algunha asignatura mostrando cal é a asignatura e
# a titulación á que pertencen as asignaturas.

In [50]:
# 48. Listaxe que mostre, por cada asignatura, os nomes completos dos alumnos matriculados.

In [53]:
# 48B. Supoñendo que se ten a seguinte táboa, que clasifica os tamamos das asignaturas en función
# do seu número de créditos.
# Nome da táboa: TamanhoAsignatura

# Tamanho | CreditosMin | CreditosMax
# Corta   | 0           | 4.5
# Media   | 6           | 7.5
# Larga   | 9           | 100

# Obtén un listado das asignaturas xunto coa calificación da súa duración segunto a táboa anterior.

In [54]:
# 49. Asignaturas da titulación de Matemáticas.

In [55]:
# 50. Listaxe de asignaturas que teñan máis créditos que 'Seguridad Vial'